In [1]:
import pandas as pd
train=pd.read_csv('http://bit.ly/kaggletrain')
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [2]:
a = train.select_dtypes(include='O')

In [3]:
a.describe()

                              Name   Sex  Ticket        Cabin Embarked
count                          891   891     891          204      889
unique                         891     2     681          147        3
top     Carter, Mr. William Ernest  male  347082  C23 C25 C27        S
freq                             1   577       7            4      644

## Map
  - Maps one series to the other based on mapping dictionary

In [35]:
train['Sex_num']=train.Sex.map({'female':0, 'male':1})

In [36]:
train.loc[0:4, ['Sex', 'Sex_num']]

      Sex  Sex_num
0    male        1
1  female        0
2  female        0
3  female        0
4    male        1

## Apply
    - Applies function to iterable

In [8]:
train['Name_length'] = train.Name.apply(len)

In [37]:
train.loc[0:4, ['Name', 'Name_length']]

                                                Name  Name_length
0                            Braund, Mr. Owen Harris          NaN
1  Cumings, Mrs. John Bradley (Florence Briggs Th...          NaN
2                             Heikkinen, Miss. Laina          NaN
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)          NaN
4                           Allen, Mr. William Henry          NaN

In [38]:
import numpy as np
train['Fare_ceil']= train.Fare.apply(np.ceil)

In [39]:
train.loc[0:4, ['Fare','Fare_ceil']]

      Fare  Fare_ceil
0   7.2500          8
1  71.2833         72
2   7.9250          8
3  53.1000         54
4   8.0500          9

In [ ]:
# Last name of each person (before comma)

In [40]:
train.Name.head()

0                              Braund, Mr. Owen Harris
1    Cumings, Mrs. John Bradley (Florence Briggs Th...
2                               Heikkinen, Miss. Laina
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                             Allen, Mr. William Henry
Name: Name, dtype: object

In [41]:
train.Name.str.split(',').head()

0                           [Braund,  Mr. Owen Harris]
1    [Cumings,  Mrs. John Bradley (Florence Briggs ...
2                            [Heikkinen,  Miss. Laina]
3      [Futrelle,  Mrs. Jacques Heath (Lily May Peel)]
4                          [Allen,  Mr. William Henry]
dtype: object

In [42]:
# take first element from each list
def get_element(my_list, position):
    return my_list[position]

In [43]:
train.Name.str.split(',').apply(get_element, position=0).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
dtype: object

In [19]:
train.Name.str.split(',').apply(lambda x: x[0]).head()

0       Braund
1      Cumings
2    Heikkinen
3     Futrelle
4        Allen
dtype: object

# Map on Dataframe
        - Applies function on Pandas by either of axis

In [44]:
drinks=pd.read_csv('http://bit.ly/drinksbycountry')

In [45]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

In [47]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(max, axis=0)

beer_servings      376
spirit_servings    438
wine_servings      370
dtype: int64

In [48]:
drinks.loc[:, 'beer_servings':'wine_servings'].apply(max, axis=1).head()

0      0
1    132
2     25
3    312
4    217
dtype: int64

In [25]:
#when you want to which column is maximum
drinks.loc[:, 'beer_servings':'wine_servings'].apply(np.argmax, axis=1).head()

0      beer_servings
1    spirit_servings
2      beer_servings
3      wine_servings
4      beer_servings
dtype: object

## ApplyMap
    - applies funcion to every element

In [27]:
drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float).head()

   beer_servings  spirit_servings  wine_servings
0              0                0              0
1             89              132             54
2             25                0             14
3            245              138            312
4            217               57             45

In [28]:
drinks.loc[:, 'beer_servings':'wine_servings'].dtypes

beer_servings      int64
spirit_servings    int64
wine_servings      int64
dtype: object

In [29]:
drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float).dtypes

beer_servings      float64
spirit_servings    float64
wine_servings      float64
dtype: object

In [30]:
drinks.loc[:, 'beer_servings':'wine_servings']=drinks.loc[:, 'beer_servings':'wine_servings'].applymap(float)

In [31]:
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa